OpenFOAM/OpenFOAM-5.x/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel PDRkEpsilon;

    PDRkEpsilonCoeffs
    {
        Cmu              0.09;
        C1               1.44;
        C2               1.92;
        C3               0;
        C4               0.1;
        alphah           1;
        alphak           1;
        alphaEps         0.76923;
    }

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
